IRP/src/Enums/DataAreaStatus/DataAreaStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>DataAreaStatus</name>
 <enumValues>
  <name>AreaPreparation</name>
 </enumValues>
 <enumValues>
  <name>Working</name>
 </enumValues>
 <enumValues>
  <name>Closed</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/CurrencyType/CurrencyType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CurrencyType</name>
 <enumValues>
  <name>Reporting</name>
 </enumValues>
 <enumValues>
  <name>Legal</name>
 </enumValues>
 <enumValues>
  <name>Agreement</name>
 </enumValues>
 <enumValues>
  <name>Budgeting</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/DataAreas/DataAreas.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>DataAreas</name>
 <attributes>
  <name>DataAreaStatus</name>
  <type>
   <types>EnumRef.DataAreaStatus</types>
  </type>
 </attributes>
 <attributes>
  <name>AdminLogin</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>AdminPassword</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>30</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>AdminLocalization</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>2</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>InterfaceLocalizationCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>5</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CompanyName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
</mdclass:Catalog>

IRP/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Users</name>
 <attributes>
  <name>InfobaseUserID</name>
  <type>
   <types>UUID</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>LocalizationCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>5</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ShowInList</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>UserGroup</name>
  <type>
   <types>CatalogRef.UserGroups</types>
  </type>
 </attributes>
 <attributes>
  <name>InterfaceLocalizationCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>5</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>FormScaleVariant</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Disable</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ChangePasswordOnNextLogin</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>TimeZone</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>150</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UserID</name>
  <type>
   <types>DefinedType.typeBarcode</types>
  </type>
 </attributes>
 <attributes>
  <name>Email</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>OSUser</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CurrencyMovementType</name>
 <type>
  <types>EnumRef.CurrencyType</types>
 </type>
 <predefined>
  <items>
   <name>SettlementCurrency</name>
   <description>Settlement currency</description>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_PartnerTerm</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_Legal</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CurrencyType</types>
  </type>
 </attributes>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/CommonModules/Saas/Module.bsl
Function SeparationUsed() Export
	Return Constants.SaasMode.Get();
EndFunction

Function isAreaActive() Export
	AreaMode = Not Saas.SeparationUsed() Or (Saas.SeparationUsed() And SessionParameters.IDUse);
	Return AreaMode;
EndFunction

Procedure SetSeparationParameters(Separators) Export
	For Each DataSeparation In Separators Do
		SessionParameters[DataSeparation.Key + "Value"] = DataSeparation.Value;
		SessionParameters[DataSeparation.Key + "Use"] = ValueIsFilled(DataSeparation.Value);
	EndDo;
EndProcedure

Function CurrentAreaStatus() Export
	Answer = New Structure("isError, Status", False, "");
	If SessionParameters.IDUse Then
		Area = Catalogs.DataAreas.FindByCode(SessionParameters.IDValue);
		If Area.IsEmpty() Then
			Answer.isError = True;
			Answer.Status = StrTemplate(R().Saas_001, SessionParameters.IDValue);
		Else
			If Not Area.DataAreaStatus = Enums.DataAreaStatus.Working Then
				Answer.isError = True;
				Answer.Status = StrTemplate(R().Saas_002, Area.DataAreaStatus);
			EndIf;
		EndIf;
	EndIf;
	Return Answer;
EndFunction

Procedure AreaUpdate() Export

	If Not SeparationUsed() Then
		Return;
	EndIf;

	Query = New Query();
	Query.Text =
	"SELECT
	|	DataAreas.Ref AS Ref,
	|	DataAreas.Code AS Code,
	|	DataAreas.AdminLogin AS AdminLogin,
	|	DataAreas.AdminPassword AS AdminPassword,
	|	DataAreas.AdminLocalization AS AdminLocalization,
	|	DataAreas.CompanyName AS CompanyName,
	|	DataAreas.InterfaceLocalizationCode
	|FROM
	|	Catalog.DataAreas AS DataAreas
	|WHERE
	|	DataAreas.DataAreaStatus = VALUE(Enum.DataAreaStatus.AreaPreparation)
	|	AND NOT DataAreas.DeletionMark
	|	AND DataAreas.Code > 0";

	QueryResult = Query.Execute();

	CurrentArea = QueryResult.Select();

	While CurrentArea.Next() Do
		// Change area
		AreaSettings = New Structure("ID", CurrentArea.Code);
		SetSeparationParameters(AreaSettings);
		
		// User group
		UserGroup = Catalogs.UserGroups.CreateItem();
		UserGroup.Description_en = "Main group";
		UserGroup.Write();
		
		// User
		User = Catalogs.Users.CreateItem();
		DescriptionStructure = New Structure();
		DescriptionStructure.Insert("Description_" + LocalizationReuse.GetLocalizationCode(), CurrentArea.AdminLogin);
		DescriptionStructure.Insert("Description_en", CurrentArea.AdminLogin);
		DescriptionStructure.Insert("Description", CurrentArea.AdminLogin);

		FillPropertyValues(User, DescriptionStructure);
		If ValueIsFilled(CurrentArea.AdminLocalization) Then
			User.LocalizationCode = CurrentArea.AdminLocalization;
		Else
			User.LocalizationCode = Metadata.DefaultLanguage.LanguageCode;
		EndIf;
		User.InterfaceLocalizationCode = CurrentArea.InterfaceLocalizationCode;
		User.ShowInList = True;
		User.UserGroup = UserGroup.Ref;
		User.AdditionalProperties.Insert("Password", CurrentArea.AdminPassword);
		User.Write();
				
		// logout area
		AreaSettings = New Structure("ID", 0);
		SetSeparationParameters(AreaSettings);

		CurrentAreaObject = CurrentArea.Ref.GetObject();
		CurrentAreaObject.DataAreaStatus = Enums.DataAreaStatus.Working;
		CurrentAreaObject.Write();

	EndDo;

EndProcedure

Function CurrentAreaID() Export
	Return SessionParameters.IDValue;
EndFunction

Function GetCurrencyMovementType_Legal() Export
	Query = New Query();
	Query.Text =
	"SELECT
	|	CurrencyMovementType.Ref
	|FROM
	|	ChartOfCharacteristicTypes.CurrencyMovementType AS CurrencyMovementType
	|WHERE
	|	CurrencyMovementType.Type = VALUE(Enum.CurrencyType.Legal)";
	QuerySelection = Query.Execute().Select();
	If QuerySelection.Next() Then
		Return QuerySelection.Ref;
	Else
		Return ChartsOfCharacteristicTypes.CurrencyMovementType.EmptyRef();
	EndIf;
EndFunction

Function GetCurrencyMovementType_Transaction() Export
	Return ChartsOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency;
EndFunction

Function isSaasMode() Export
	Return GetFunctionalOption("SaasMode");
EndFunction
